# Intermediate SQL

## Selecting with data

#### Using WHERE with numbers

Filtering with `WHERE` allows you to analyze your data better. You may have a dataset that includes a range of different movies, and you need to do a case study on the most notable films with the biggest budgets. In this case, you'll want to filter your data to a specific `budget` range.

Now it's your turn to use the `WHERE` clause to filter numeric values!

In [6]:
import cx_Oracle
import pandas as pd

def print_all():
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute("SELECT * FROM FILMS")
    return pd.DataFrame(cursor)

def run_statement(sql):
    connection = cx_Oracle.connect(user="DATASETS_CHAN", password="123", dsn="localhost:1521/xe")
    cursor = connection.cursor()
    cursor.execute(sql)
    display(pd.DataFrame(cursor))

#### Instructions
* Select the `film_id` and `imdb_score` from the `reviews` table and filter on scores higher than 7.0.

In [8]:
# Return the unique countries from the films table
sql = """
SELECT film_id, imdb_score
FROM REVIEWS
WHERE imdb_score > 7.0
"""
run_statement(sql)

         0    1
0     1608  7.4
1      881  8.0
2      128  7.1
3     4760  7.8
4     2213  7.2
...    ...  ...
1531   424  7.8
1532  4668  7.2
1533  3330  7.3
1534   431  8.4
1535   261  7.8

[1536 rows x 2 columns]

* Select the `film_id` and `facebook_likes of the first ten records with less than 1000 likes from the `reviews` table.

In [12]:
sql = """
SELECT film_id, facebook_likes
FROM reviews
WHERE facebook_likes < 1000
LIMIT 10;
"""
run_statement(sql)

DatabaseError: ORA-00933: SQL command not properly ended

* Count how many records have a `num_votes` of at least 100,000; use the alias `films_over_100k_votes`.

In [13]:
sql = """
SELECT COUNT(num_votes) AS films_over_100K_votes
FROM reviews
WHERE num_votes > 100000
"""
run_statement(sql)

      0
0  1211